Repository: AhmadHaniShaheen/for-note
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Cancel
ar: تراجع

# cannot_share_empty_note_prompt
source: Cannot share an empty note!
ar: لا يمكن مشاركة مهمة فارغة!

source: Delete
ar: حذف

# delete_note_prompt
source: Are you sure you want to delete this note?
ar: هل أنت متأكد أنك تريد حذف هذه المهمة؟

# email_text_field_placeholder
source: Enter your email here
ar: أدخل عنوان بريدك الإلكتروني هنا

# email_text_field_short
source: your email is so short
ar: عدد أحرف البريد الإلكتروني قصير

source: Forgot Password
ar: نسيت كلمة السر

# forgot_password_view_back_to_login
source: Back to login page
ar: العودة إلى صفحة تسجيل الدخول

# forgot_password_view_generic_error
source: We could not process your request. Please make sure that you are a registered user, or if not, register a user now by going back one step.
ar: لم نتمكن من إتمام طلبك. يرجى التأكد من أنك مستخدم مسجل ، أو إذا لم يكن كذلك ، فقم بتسجيل مستخدم الآن من خلال الرجوع خطوة واحدة إلى الوراء.

# forgot_password_view_prompt
source: If you forgot your password, simply enter your email and we will send you a password reset link.
ar: إذا نسيت كلمة المرور الخاصة بك ، فما عليك سوى إدخال بريدك الإلكتروني وسنرسل لك رابط إعادة تعيين كلمة المرور.

# forgot_password_view_send_me_link
source: Send me password reset link
ar: أرسل لي رابط إعادة تعيين كلمة المرور

# generic_error_prompt
source: An error occurred
ar: حدث خطأ ما

source: Login
ar: تسجيل دخول

# login_welecom
source: Welcome! Glad to see you here!
ar: أهلا سعيد برؤيتك هنا

# login_error_auth_error
source: Authentication error
ar: خطأ مصادقة

# login_error_cannot_find_user
source: Cannot find a user with the entered credentials!
ar: لا يمكن العثور على مستخدم ببيانات الاعتماد التي تم إدخالها!

# login_error_wrong_credentials
source: Wrong credentials
ar: بيانات مستخدمة خاطئة

# login_view_forgot_password
source: I forgot my password
ar: لقد نسيت كلمة المرور

# login_view_not_registered_yet
source: Not registered yet? Register here!
ar: ليس لديك حساب؟ سجل هنا!

# login_view_prompt
source: Please log in to your account in order to interact with and create notes!
ar: يرجى تسجيل الدخول إلى حسابك للتفاعل معه وإنشاء ملاحظات!

# logout_button
source: Log out
ar: تسجيل خروج

# logout_dialog_prompt
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Note
ar: مهمة

source: New Note
ar: مهمة جديدة

# new_note_placeholder
source: start typing your note
ar: إبدأ بكتابة مهامك

# notes_first_title
source: Your Notes
ar: مهامك

# notes_title
source: {count, plural, =0{No notes yet} =1{1 note} other{{count} notes}}
ar: {count, plural, =0{ليس هناك مهام بعد} =1{ مهمة واحدة} other{{count} مهام}}

source: OK
ar: حسناً

source: Password reset
ar: إعادة تعيين كلمة المرور

# password_reset_dialog_prompt
source: We have now sent you a password reset link. Please check your email for more information.
ar: لقد أرسلنا لك الآن رابط إعادة تعيين كلمة المرور. يرجى التحقق من بريدك الإلكتروني لمزيد من المعلومات.

# password_text_field_placeholder
source: Enter your password here
ar: أدخل كلمة المرور الخاصة بك هنا

source: Register
ar: إنشاء حساب

# register_welcome
source: Hello! Register to get started
ar: سعيد برؤيتك هنا إنشئ حسابك للبدء بتدوين مهامك

# register_error_email_already_in_use
source: This email is already registered to another user. Please choose another email!
ar: هذا البريد الإلكتروني مسجل بالفعل لمستخدم آخر. الرجاء اختيار بريد إلكتروني آخر!

# register_error_generic
source: Failed to register. Please try again later!
ar: فشل في تسجيل. الرجاء معاودة المحاولة في وقت لاحق!

# register_error_invalid_email
source: The email address you entered appears to be invalid. Please try another email address!
ar: يبدو أن عنوان البريد الإلكتروني الذي أدخلته غير صالح. يرجى محاولة عنوان بريد إلكتروني آخر!

# register_error_weak_password
source: This password is not secure enough. Please choose another password!
ar: كلمة المرور هذه ليست آمنة بما يكفي. الرجاء اختيار كلمة مرور أخرى!

# register_view_already_registered
source: Already registered?
ar: لديك حساب؟

# register_view_prompt
source: Enter your email and password to see your notes!
ar: أدخل بريدك الإلكتروني وكلمة المرور لترى مهامك!

source: Restart
ar: إعادة تشغيل

source: Sharing
ar: مشاركة

source: Start typing your note
ar: ابدأ في كتابة مهامك

source: Verify email
ar: التحقق من البريد الإكتروني

# verify_email_send_email_verification
source: Send email verification
ar: إرسال التحقق من البريد الإلكتروني

# verify_email_view_prompt
source: we have sent to you email to verify your email, cleck to Veriry, then go back to Login view
ar: لقد أرسلنا إليك بريدًا إلكترونيًا للتحقق من بريدك الإلكتروني ، انقر فوق زر التحقق ، ثم ارجع إلى عرض تسجيل الدخول

# verify_email_sent_email_again
source: If you did not reseve an email, click this button to send a verification code
ar: إذا لم يتم ارسال بريد إلكتروني لك ، فانقر فوق هذا الزر لإرسال رمز التحقق

# verify_email_send_email_verification_button
source: send email to Verifyication again
ar: إرسال بريد إلكتروني للتحقق مرة أخرى

source: Yes
ar: نعم

source: Login now
ar: تسجيل دخول

# forgot_password_description_view
source: Don't worry! It occurs. Please enter the email address linked with your account
ar: لا تقلق! يحدث. الرجاء إدخال عنوان البريد الإلكتروني المرتبط بحسابك
